[
  {
    "intent": "greetings",
    "patterns": [
      "hi",
      "hello",
      "hey",
      "good morning",
      "नमस्ते",
      "नमस्कार",
      "सुप्रभात"
    ],
    "response": "Hello! 👋 How can I help you today?",
    "response_hindi": "नमस्ते! 👋 मैं आज आपकी किस प्रकार सहायता कर सकता हूँ?"
  },
  {
    "intent": "thanks",
    "patterns": [
      "thanks",
      "thank you",
      "thank u",
      "धन्यवाद",
      "शुक्रिया"
    ],
    "response": "You're welcome! Is there anything else I can help with?",
    "response_hindi": "आपका स्वागत है! क्या मैं आपकी और कोई मदद कर सकता हूँ?"
  },
  {
    "intent": "cadd_course_organizers",
    "patterns": [
      "Who is organizing the COMPUTER ASSISTED DRUG DESIGN course?",
      "CADD course organizers?",
      "Who is running the CADD course?",
      "Tell me who organizes the drug design course.",
      "कंप्यूटर एडेड ड्रग डिजाइन कोर्स का आयोजन कौन कर रहा है?",
      "CADD कोर्स कौन आयोजित कर रहा है?",
      "ड्रग डिजाइन कोर्स के आयोजक कौन हैं?"
    ],
    "response": "The course is jointly organized by the Design Innovation Centre at the University of Rajasthan, Jaipur, and the Design Innovation Center at the Birla Institute of Scientific Research, Jaipur.",
    "response_hindi": "यह कोर्स संयुक्त रूप से डिजाइन इनोवेशन सेंटर, राजस्थान विश्वविद्यालय, जयपुर और डिजाइन इनोवेशन सेंटर, बिड़ला इंस्टीट्यूट ऑफ साइंटिफिक रिसर्च, जयपुर द्वारा आयोजित किया जाता है।"
  },
  {
    "intent": "cadd_course_objectives",
    "patterns": [
      "What are the objectives of the CADD course?",
      "CADD course objectives",
      "What will I learn in the CADD course?",
      "Drug design course goals",
      "CADD पाठ्यक्रम के उद्देश्य क्या हैं?",
      "CADD कोर्स का उद्देश्य",
      "मैं CADD कोर्स में क्या सीखूंगा?",
      "ड्रग डिजाइन कोर्स के लक्ष्य"
    ],
    "response": "The course aims to provide an in-depth overview of 'Drug Designing' techniques, teach how to design and interpret the results of Molecular Modeling, Docking, & Simulations, and offer hands-on experience with advanced computational tools.",
    "response_hindi": "इस पाठ्यक्रम का उद्देश्य 'ड्रग डिजाइनिंग' तकनीकों का गहन अवलोकन प्रदान करना, मॉलिक्यूलर मॉडलिंग, डॉकिंग और सिमुलेशन के परिणामों को डिजाइन और व्याख्या करना सिखाना और उन्नत कम्प्यूटेशनल टूल के साथ व्यावहारिक अनुभव प्रदान करना है।"
  },
  {
    "intent": "cadd_course_eligibility",
    "patterns": [
      "What are the eligibility criteria for the CADD course?",
      "Who can apply for the CADD course?",
      "CADD eligibility",
      "Am I eligible for the drug design course?",
      "CADD पाठ्यक्रम के लिए पात्रता मानदंड क्या हैं?",
      "CADD कोर्स के लिए कौन आवेदन कर सकता है?",
      "CADD पात्रता",
      "क्या मैं ड्रग डिजाइन कोर्स के लिए पात्र हूं?"
    ],
    "response": "Eligible candidates include those with a Postgraduate Degree in fields like Chemistry, Biochemistry, or Biotechnology; those with a B.E./B.Tech., M.E./M.Tech., or M.Pharm with basic chemistry knowledge; final year students of these courses; and Research Scholars in life or chemical sciences.",
    "response_hindi": "पात्र उम्मीदवारों में रसायन विज्ञान, जैव रसायन, या जैव प्रौद्योगिकी जैसे क्षेत्रों में स्नातकोत्तर डिग्री वाले; बुनियादी रसायन विज्ञान ज्ञान के साथ बी.ई./बी.टेक., एम.ई./एम.टेक., या एम.फार्म करने वाले; इन पाठ्यक्रमों के अंतिम वर्ष के छात्र; और जीवन या रसायन विज्ञान में शोध अध्येता शामिल हैं।"
  },
  {
    "intent": "cadd_course_duration_fees",
    "patterns": [
      "What is the duration and cost of the CADD course?",
      "CADD course duration and fees?",
      "How long is the CADD course?",
      "Is the drug design course free?",
      "CADD पाठ्यक्रम की अवधि और लागत क्या है?",
      "CADD कोर्स की अवधि और फीस?",
      "CADD कोर्स कितने समय का है?",
      "क्या ड्रग डिजाइन कोर्स मुफ्त है?"
    ],
    "response": "The course is one semester (60 hours) long and is conducted in a hybrid mode. There are no fees if the candidate is recommended by their parent organization. A certificate is awarded upon successful completion with a minimum of 75% attendance.",
    "response_hindi": "यह पाठ्यक्रम एक सेमेस्टर (60 घंटे) लंबा है और इसे हाइब्रिड मोड में आयोजित किया जाता है। यदि उम्मीदवार को उनके मूल संगठन द्वारा अनुशंसित किया जाता है तो कोई शुल्क नहीं है। न्यूनतम 75% उपस्थिति के साथ सफलतापूर्वक पूरा होने पर एक प्रमाण पत्र प्रदान किया जाता है।"
  },
  {
    "intent": "cadd_important_dates",
    "patterns": [
      "What are the important dates for the CADD course?",
      "CADD course dates",
      "When is the application deadline for CADD?",
      "When does the drug design course start?",
      "CADD कोर्स के लिए महत्वपूर्ण तिथियां क्या हैं?",
      "CADD कोर्स की तारीखें",
      "CADD के लिए आवेदन की अंतिम तिथि कब है?",
      "ड्रग डिजाइन कोर्स कब शुरू होता है?"
    ],
    "response": "The last date to apply is September 20th, 2025, and the course begins on September 26th, 2025.",
    "response_hindi": "आवेदन करने की अंतिम तिथि 20 सितंबर, 2025 है और पाठ्यक्रम 26 सितंबर, 2025 से शुरू होगा।"
  },
  {
    "intent": "cadd_application_process",
    "patterns": [
      "How can I apply for the CADD course?",
      "CADD application process",
      "Where to apply for the drug design course?",
      "CADD course apply",
      "मैं CADD कोर्स के लिए कैसे आवेदन कर सकता हूं?",
      "CADD आवेदन प्रक्रिया",
      "ड्रग डिजाइन कोर्स के लिए कहां आवेदन करें?",
      "CADD कोर्स आवेदन"
    ],
    "response": "You can apply online at https://www.bisr.res.in/cadd.php or offline by sending a scanned copy of the application to radhakishan@bisr.res.in before September 20th, 2025.",
    "response_hindi": "आप https://www.bisr.res.in/cadd.php पर ऑनलाइन आवेदन कर सकते हैं या 20 सितंबर, 2025 से पहले radhakishan@bisr.res.in पर आवेदन की स्कैन की हुई प्रति भेजकर ऑफ़लाइन आवेदन कर सकते हैं।"
  },
  {
    "intent": "archery_tournament_schedule",
    "patterns": [
      "When is the inter-college archery tournament?",
      "Archery tournament dates",
      "When is the archery competition?",
      "Archery game date",
      "अंतर-कॉलेज तीरंदाजी टूर्नामेंट कब है?",
      "तीरंदाजी टूर्नामेंट की तारीखें",
      "तीरंदाजी प्रतियोगिता कब है?",
      "तीरंदाजी खेल की तारीख"
    ],
    "response": "The Rajasthan University Inter-college Archery (Men/Women) competition will be held from September 15th to 16th, 2025, at the university's archery ground.",
    "response_hindi": "राजस्थान विश्वविद्यालय अंतर-कॉलेज तीरंदाजी (पुरुष/महिला) प्रतियोगिता 15 से 16 सितंबर, 2025 तक विश्वविद्यालय के तीरंदाजी मैदान में आयोजित की जाएगी।"
  },
  {
    "intent": "archery_tournament_meeting",
    "patterns": [
      "Is there a meeting for the archery tournament managers?",
      "Archery tournament meeting",
      "When is the manager's meeting for archery?",
      "Archery meeting",
      "क्या तीरंदाजी टूर्नामेंट प्रबंधकों के लिए कोई बैठक है?",
      "तीरंदाजी टूर्नामेंट बैठक",
      "तीरंदाजी के लिए मैनेजर की बैठक कब है?",
      "तीरंदाजी बैठक"
    ],
    "response": "Yes, the manager's meeting for both men's and women's categories is on September 15th, 2025, at 8:00 AM in the computer lab of the Department of Physical Education.",
    "response_hindi": "हां, पुरुष और महिला दोनों श्रेणियों के लिए प्रबंधक की बैठक 15 सितंबर, 2025 को सुबह 8:00 बजे शारीरिक शिक्षा विभाग की कंप्यूटर लैब में है।"
  },
  {
    "intent": "archery_tournament_contact",
    "patterns": [
      "Who can I contact for details about the archery tournament?",
      "Archery tournament contact",
      "Contact for archery competition",
      "Archery contact person",
      "तीरंदाजी टूर्नामेंट के बारे में जानकारी के लिए मैं किससे संपर्क कर सकता हूं?",
      "तीरंदाजी टूर्नामेंट संपर्क",
      "तीरंदाजी प्रतियोगिता के लिए संपर्क",
      "तीरंदाजी संपर्क व्यक्ति"
    ],
    "response": "For more information, you can contact Dr. Pratibha Singh Ratnu, Assistant Director of Physical Education, at 8619992433.",
    "response_hindi": "अधिक जानकारी के लिए, आप शारीरिक शिक्षा के सहायक निदेशक डॉ. प्रतिभा सिंह रतनू से 8619992433 पर संपर्क कर सकते हैं। "
  },
  {
    "intent": "taekwondo_competition_update",
    "patterns": [
      "What is the status of the Taekwondo inter-college competition?",
      "Taekwondo competition status",
      "Is the Taekwondo competition happening?",
      "Taekwondo game date",
      "ताइक्वांडो अंतर-कॉलेज प्रतियोगिता की स्थिति क्या है?",
      "ताइक्वांडो प्रतियोगिता की स्थिति",
      "क्या ताइक्वांडो प्रतियोगिता हो रही है?",
      "ताइक्वांडो खेल की तारीख"
    ],
    "response": "The Rajasthan University Inter-college Taekwondo competition for men and women, originally scheduled for September 13-14, 2025, has been postponed until further notice.",
    "response_hindi": "राजस्थान विश्वविद्यालय अंतर-कॉलेज ताइक्वांडो प्रतियोगिता पुरुष और महिला, जो मूल रूप से 13-14 सितंबर, 2025 के लिए निर्धारित थी, को अगली सूचना तक के लिए स्थगित कर दिया गया है।"
  }
]